## [terraform-starter](https://jdrodriguezrui.app.spacelift.io/stack/terraform-starter/run/01HYEMC8D65FV2C20RV4ZZM6JK) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HYEBBR9A2838EGC4D4YN2QAD] Planning changes with 0 custom hooks...
data.spacelift_current_stack.this: Reading...
data.spacelift_current_stack.this: Read complete after 0s [id=terraform-starter]
spacelift_stack.managed: Refreshing state... [id=managed-stack]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.test will be created
  + resource "google_storage_bucket" "test" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "julian-spacelift-poc-test"
      + project                     = "development-env-ta"
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "REGIONAL"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

[01HYEBBR9A2838EGC4D4YN2QAD] Changes are GO
[01HYEBBR9A2838EGC4D4YN2QAD] Uploading the list of managed resources...
[01HYEBBR9A2838EGC4D4YN2QAD] Please be aware that the run changes calculation includes output changes.
[01HYEBBR9A2838EGC4D4YN2QAD] Resource list upload is GO
[01HYEBBR9A2838EGC4D4YN2QAD] Generating JSON representation of the plan...
[01HYEBBR9A2838EGC4D4YN2QAD] JSON representation is GO
[01HYEBBR9A2838EGC4D4YN2QAD] Loading custom plan policy inputs...
[01HYEBBR9A2838EGC4D4YN2QAD] 0 custom plan policy inputs found
[01HYEBBR9A2838EGC4D4YN2QAD] No plan policies to evaluate
```

</details>